# language: zh-CN
@mobile
功能: 登陆东方融资网着陆页

  场景: M站贷款着陆页
    假如 我在"/lp/daikuan"着陆页
    并且 输入贷款信息
    同时 点击马上申请
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页


  场景: M站信用着陆页
    假如 我在信用着陆页
    并且 选择贷款城市北京
    当 输入信用贷款信息
    同时 点击免费申请贷款
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页



  场景: M站onekey着陆页
    假如 我在"/lp/onekey"着陆页
    并且 输入极速贷款信息
    同时 点击极速贷款
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页

  场景: M站evaluate着陆页
    假如 我在"/lp/evaluate"着陆页
    并且 输入贷款的信息
    同时 点击evaluate的极速贷款
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页

  场景: M站daikuan1着陆页
    假如 我在"/lp/daikuan1"着陆页
    并且 输入贷款one的信息
    同时 点击贷款one马上申请
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页

  场景: M站daikuanzixun着陆页
    假如 我在"/lp/daikuanzixun"着陆页
    并且 输入贷款咨询的信息
    同时 点击贷款咨询申请
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页

  场景: M站YiXin着陆页
    假如 我在YiXin着陆页
    并且 输入立即借款的信息
    同时 点击立即借款
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页

  场景: M站qinghuai着陆页
    假如 我在qinghuai着陆页
    并且 选择城市上海
    当 输入立即免费申请的信息
    同时 点击立即免费申请
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页

  场景: M站qinghuai1着陆页
    假如 我在qinghuai one着陆页
    并且 选择城市北京
    当 输入情怀one的信息
    同时 点击情怀one的申请
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页

  场景: M站chaoshi着陆页
    假如 我在chaoshi着陆页
    并且 选择城市苏州
    当 输入chaoshi的信息
    同时 点击chaoshi的申请
    并且 成功进入M站测评页面
    那么 成功进入到M站测评结果页



