# language: zh-CN

@web_lp
功能: 登陆东方融资网着陆页

  场景: 贷款着陆页立即咨询
    假如 我在贷款着陆页首页"http://shanghai.rongzi.com/lp/daikuan"
    并且 输入贷款着陆页用户信息
    同时 点击贷款着陆页立即咨询
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 贷款着陆页马上借款
    假如 我在贷款着陆页首页"http://shanghai.rongzi.com/lp/daikuan"
    并且 我点击马上借款
    那么 跳转到智能贷，为您精准推荐优质贷款页面
    同时 填写联系方式
    那么 成功进入测评页面

  场景: 贷款着陆页贷款更快
    假如 我在贷款着陆页首页"http://shanghai.rongzi.com/lp/daikuan"
    当 输入贷款的用户信息
    同时 点击立即咨询
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面


  场景: 精简着陆页登陆
    假如 我在"/lp/jingjian"着陆页首页
    并且 输入精简着陆页用户信息
    同时 点击精简着陆页立即咨询
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 精简着陆页我要申请
    假如 我在"/lp/jingjian"着陆页首页
    当 点击我要申请
    那么 就要输入免费申请的个人信息
    同时 点击提交
    那么 成功进入测评页面


  场景: 完全着陆页登陆
    假如 我在"/lp/wanquan"着陆页首页
    并且 输入完全着陆页用户信息
    同时 点击完全着陆页立即免费咨询
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 完全着陆页页面中部蓝色智能贷
    假如 我在"/lp/wanquan"着陆页首页
    当  填写智能贷款个人信息
    并且 点击免费智能贷款
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 完全着陆页页面我也要免费申请
    假如 我在"/lp/wanquan"着陆页首页
    当 我点击我也要免费申请
    那么 就要输入免费申请的个人信息
    同时 点击提交
    那么 成功进入测评页面

  场景: 宜信着陆页登陆
    假如 我在"/lp/yixin"着陆页首页
    并且 输入宜信着陆页用户信息
    同时 点击宜信着陆页立即申请
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 宜信1着陆页登陆
    假如 我在宜信one着陆页首页"http://shanghai.rongzi.com/lp/yixin1"
    并且 输入宜信one着陆页用户信息
    同时 点击宜信one着陆页立即申请
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 企业着陆页登陆
    假如 我在"/lp/qiye"着陆页首页
    并且 输入企业着陆页用户信息
    同时 点击企业着陆页立即免费申请
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 企业着陆页立即免费申请
    假如 我在"/lp/qiye"着陆页首页
    当 我点击免费申请
    那么 就要输入免费申请的个人信息
    同时 点击提交
    那么 成功进入测评页面

  场景: 车抵的com着陆页登陆
    假如 我在车抵着陆页首页"http://shanghai.rongzi.com/lp/chedi"
    并且 输入车抵着陆页用户信息
    同时 点击车抵着陆页立即咨询
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 车抵的com着陆页查看详情
    假如 我在车抵着陆页首页"http://shanghai.rongzi.com/lp/chedi"
    并且 点击查看详情
    那么 跳转到智能贷，为您精准推荐优质贷款页面
    同时 填写联系方式
    那么 成功进入测评页面
    并且 点击快速选款
    那么 成功进入到测评结果页


  场景: onepage的cn着陆页登陆
    假如 我在onepage着陆页首页"http://shanghai.rongzi.cn/static/onepage"
    并且 输入onepage着陆页用户信息
    同时 点击onepage着陆页立即申请
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 贷款申请提交成功

  场景: onepage的cn着陆页立即免费咨询
    假如 我在onepage着陆页首页"http://shanghai.rongzi.cn/static/onepage"
    当 点击立即免费咨询
    同时 就要输入onepage的cn着陆页贷款信息
    那么 贷款申请提交成功

  场景: 企业one着陆页登陆
    假如 我在"/lp/qiye1"着陆页首页
    并且 输入企业one着陆页用户信息
    同时 点击企业one着陆页立即免费申请
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景: 企业one着陆页免费申请
    假如 我在"/lp/qiye1"着陆页首页
    并且 点击中部免费申请
    同时 填写免费申请信息
    那么 成功进入测评页面

  场景: 企业one着陆页免费申请
    假如 我在"/lp/qiye1"着陆页首页
    并且 点击底部免费申请
    同时 填写免费申请信息
    那么 成功进入测评页面

  场景:cn站登录
    假如 我在"http://www.rongzi.cn"
    同时 选择贷款城市上海
    并且 输入免费咨询申请信息
    那么 就要输入验证码
    并且 我点击提交验证码
    那么 成功进入测评页面

  场景:cn站登录
    假如 我在"http://www.rongzi.cn"
    同时 选择贷款城市上海
    当 点击获取每月最低还款
    并且 填写下一步的信息
    同时 获得最低贷款额
    那么 成功进入测评页面

  场景:cn站登录
    假如 我在"http://www.rongzi.cn"
    同时 选择贷款城市上海
    当 点击下一步
    并且 填写下一步的信息
    同时 获得最低贷款额
    那么 成功进入测评页面








